kanchandebnath/digifest_hackathon/platform/cc2538dk/dev/smartrf-sensors.c
/*
 * Copyright (c) 2012, Texas Instruments Incorporated - http://www.ti.com/
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * ``AS IS'' AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL THE
 * COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
 * OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/**
 * \addtogroup cc2538-smartrf
 * @{
 *
 * \defgroup cc2538-smartrf-sensors SmartRF06EB Sensors
 *
 * Generic module controlling sensors on the SmartRF06EB
 * @{
 *
 * \file
 * Implementation of a generic module controlling SmartRF06EB sensors
 */
#include "contiki.h"
#include "dev/button-sensor.h"
#include "dev/als-sensor.h"
#include "dev/ac-dimmer.h"
#include "dev/current-sensor.h"
#include "dev/cc2538-sensors.h"
#include "radio-sensor.h"

#include <string.h>

/** \brief Exports a global symbol to be used by the sensor API */
#if SMART_RF06_BOARD
SENSORS(&button_select_sensor, &button_left_sensor, &button_right_sensor,
        &button_up_sensor, &button_down_sensor, &als_sensor,
        &cc2538_temp_sensor, &vdd3_sensor, &radio_sensor);

#elif SMART_STREET_LIGHT_BOARD

#if 0
SENSORS(&presence_sensor, &button_left_sensor, &button_right_sensor,
        &button_up_sensor, &button_down_sensor, &als_sensor, &current_sensor,
        &cc2538_temp_sensor, &vdd3_sensor, &radio_sensor, &ac_dimmer);
#endif 
SENSORS(&presence_sensor, &presence_sensor1, /*&button_left_sensor,*/  &als_sensor, &current_sensor,
        &cc2538_temp_sensor, &vdd3_sensor, &radio_sensor, &ac_dimmer);
#endif


/**
 * @}
 * @}
 */
